package com.github.bigdansobig.hardlessons.lesson4;

public class Main {

    // Задание 04.05.2020 (05.05.2020 выходной):
    // Написать приложение, которое реализует робота,
    // который умеет считать. Используйте внутри уже
    // написанный вами класс Math.
    // Сделайте у робота метод calc(),
    // в котором нужно использовать как минимум 3
    // из написанных вами метода класса Math,
    // по порядку. (Например: сначала сложение,
    // потом умножение, потом деление).
    // Сделать чтобы робот считал используя
    // свои заготовленные числа и чтобы эти
    // числа можно было поменять при помощи
    // методов setNumber1(), setNumber2().
    //
    // Дополнительно:
    // Наследовать (extands) робота и переопределить
    // у него метод calc(). Сделать у нового робота
    // какой-то отличительный признак (например новый робот
    // очень любит умножение, а также число 10).
    // В методе calc у него сделать чтобы он только умножал
    // 3 раза подряд и дополнительно сделать ему метод,
    // который будет выдавать умножение 2 его любимых чисел.
    // А также сделать так чтобы методы setNumber1 и setNumber2
    // не работали, а изначально объявить number 1 и 2 равными 10.

    public static void main(String[] args) {

    }
}
